{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<bos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<eos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": null,
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<pad>": 0,
      "<unk>": 1,
      "<bos>": 2,
      "<eos>": 3,
      "!": 4,
      "\"": 5,
      "#": 6,
      "$": 7,
      "%": 8,
      "&": 9,
      "'": 10,
      "(": 11,
      ")": 12,
      "*": 13,
      "+": 14,
      ",": 15,
      "-": 16,
      ".": 17,
      "/": 18,
      "0": 19,
      "1": 20,
      "2": 21,
      "3": 22,
      "4": 23,
      "5": 24,
      "6": 25,
      "7": 26,
      "8": 27,
      "9": 28,
      ":": 29,
      ";": 30,
      "<": 31,
      "=": 32,
      ">": 33,
      "?": 34,
      "@": 35,
      "A": 36,
      "B": 37,
      "C": 38,
      "D": 39,
      "E": 40,
      "F": 41,
      "G": 42,
      "H": 43,
      "I": 44,
      "J": 45,
      "K": 46,
      "L": 47,
      "M": 48,
      "N": 49,
      "O": 50,
      "P": 51,
      "Q": 52,
      "R": 53,
      "S": 54,
      "T": 55,
      "U": 56,
      "V": 57,
      "W": 58,
      "X": 59,
      "Y": 60,
      "Z": 61,
      "[": 62,
      "\\": 63,
      "]": 64,
      "^": 65,
      "_": 66,
      "`": 67,
      "a": 68,
      "b": 69,
      "c": 70,
      "d": 71,
      "e": 72,
      "f": 73,
      "g": 74,
      "h": 75,
      "i": 76,
      "j": 77,
      "k": 78,
      "l": 79,
      "m": 80,
      "n": 81,
      "o": 82,
      "p": 83,
      "q": 84,
      "r": 85,
      "s": 86,
      "t": 87,
      "u": 88,
      "v": 89,
      "w": 90,
      "x": 91,
      "y": 92,
      "z": 93,
      "{": 94,
      "|": 95,
      "}": 96,
      "~": 97,
      "¡": 98,
      "¢": 99,
      "£": 100,
      "¤": 101,
      "¥": 102,
      "¦": 103,
      "§": 104,
      "¨": 105,
      "©": 106,
      "ª": 107,
      "«": 108,
      "¬": 109,
      "®": 110,
      "¯": 111,
      "°": 112,
      "±": 113,
      "²": 114,
      "³": 115,
      "´": 116,
      "µ": 117,
      "¶": 118,
      "·": 119,
      "¸": 120,
      "¹": 121,
      "º": 122,
      "»": 123,
      "¼": 124,
      "½": 125,
      "¾": 126,
      "¿": 127,
      "Â": 128,
      "Ã": 129,
      "Ä": 130,
      "Å": 131,
      "Æ": 132,
      "Ç": 133,
      "È": 134,
      "É": 135,
      "Ê": 136,
      "Ë": 137,
      "Ì": 138,
      "Í": 139,
      "Î": 140,
      "Ï": 141,
      "Ð": 142,
      "Ñ": 143,
      "Ö": 144,
      "×": 145,
      "Ø": 146,
      "Ù": 147,
      "Û": 148,
      "à": 149,
      "á": 150,
      "â": 151,
      "ã": 152,
      "ä": 153,
      "å": 154,
      "æ": 155,
      "ç": 156,
      "è": 157,
      "é": 158,
      "ê": 159,
      "ë": 160,
      "ì": 161,
      "í": 162,
      "î": 163,
      "ï": 164,
      "ð": 165,
      "Ā": 166,
      "ĉ": 167,
      "Ċ": 168,
      "Đ": 169,
      "Ġ": 170,
      "Ģ": 171,
      "ģ": 172,
      "Ĥ": 173,
      "ĥ": 174,
      "Ħ": 175,
      "ħ": 176,
      "Ĩ": 177,
      "ĩ": 178,
      "Ī": 179,
      "ī": 180,
      "Ĭ": 181,
      "ĭ": 182,
      "Į": 183,
      "į": 184,
      "İ": 185,
      "ı": 186,
      "Ĳ": 187,
      "ĳ": 188,
      "Ĵ": 189,
      "ĵ": 190,
      "Ķ": 191,
      "ķ": 192,
      "ĸ": 193,
      "Ĺ": 194,
      "ĺ": 195,
      "Ļ": 196,
      "ļ": 197,
      "Ľ": 198,
      "ľ": 199,
      "Ŀ": 200,
      "ŀ": 201,
      "Ł": 202,
      "ł": 203,
      "Ń": 204,
      "Ġt": 205,
      "in": 206,
      "Ġa": 207,
      "he": 208,
      "ut": 209,
      "re": 210,
      "Ġs": 211,
      "er": 212,
      "le": 213,
      "on": 214,
      "Ġthe": 215,
      "is": 216,
      "put": 217,
      "en": 218,
      "Ġo": 219,
      "ing": 220,
      "Ġin": 221,
      "te": 222,
      "ou": 223,
      "ti": 224,
      "mp": 225,
      "Ġf": 226,
      "Ġc": 227,
      "Ġn": 228,
      "Ġof": 229,
      "mple": 230,
      "Ġl": 231,
      "Ġan": 232,
      "ist": 233,
      "tion": 234,
      "ample": 235,
      "Ġw": 236,
      "Sample": 237,
      "Ġre": 238,
      "or": 239,
      "es": 240,
      "ha": 241,
      "tr": 242,
      "utput": 243,
      "In": 244,
      "al": 245,
      "ent": 246,
      "Ġlist": 247,
      "ers": 248,
      "Output": 249,
      "Input": 250,
      "You": 251,
      "Ġe": 252,
      "Ġis": 253,
      "Ġp": 254,
      "ction": 255,
      "Ġand": 256,
      "un": 257,
      "ac": 258,
      "um": 259,
      "as": 260,
      "ar": 261,
      "teg": 262,
      "Ġd": 263,
      "Ġto": 264,
      "Ġinteg": 265,
      "th": 266,
      "Ġb": 267,
      "tring": 268,
      "unction": 269,
      "Ġstring": 270,
      "Ġfunction": 271,
      "Ġare": 272,
      "Ġi": 273,
      "ĠA": 274,
      "tu": 275,
      "Ġm": 276,
      "ĠInput": 277,
      "ĠOutput": 278,
      "Ġ1": 279,
      "Ġtha": 280,
      "Ġg": 281,
      "ĠT": 282,
      "iv": 283,
      "Ġnum": 284,
      "Ġâ": 285,
      "Ġâī": 286,
      "Ġâī¤": 287,
      "ed": 288,
      "Ġthat": 289,
      "Ġcon": 290,
      "ld": 291,
      "tur": 292,
      "turn": 293,
      "ment": 294,
      "ro": 295,
      "Ġsh": 296,
      "res": 297,
      "ould": 298,
      "ĠYou": 299,
      "Ġshould": 300,
      "ask": 301,
      "Ġtask": 302,
      "Ġreturn": 303,
      "Ġnumb": 304,
      "ĠThe": 305,
      "ĠYour": 306,
      "iven": 307,
      "ta": 308,
      "Ġgiven": 309,
      "Ġintegers": 310,
      "ri": 311,
      "Ġwi": 312,
      "ra": 313,
      "Ġ(": 314,
      "Ġinteger": 315,
      "me": 316,
      "ic": 317,
      "Ġ10": 318,
      "Ġwith": 319,
      "Ġle": 320,
      "qu": 321,
      "ach": 322,
      "Ġv": 323,
      "ted": 324,
      "ll": 325,
      "ts": 326,
      "pres": 327,
      "Ġbe": 328,
      "ce": 329,
      "Ġor": 330,
      "Ġrepres": 331,
      "st": 332,
      "se": 333,
      "ve": 334,
      "tain": 335,
      "Ġeach": 336,
      "an": 337,
      "Ġas": 338,
      "ge": 339,
      "mplement": 340,
      "Ġco": 341,
      "Ġrepresent": 342,
      "at": 343,
      "Ġcontain": 344,
      "Ġwhe": 345,
      "Ġval": 346,
      "Ġnumber": 347,
      "de": 348,
      "Ġdi": 349,
      "si": 350,
      "ly": 351,
      "Ġse": 352,
      "ter": 353,
      "Ġwhere": 354,
      "ate": 355,
      "Ġrepresenting": 356,
      "up": 357,
      "ary": 358,
      "Ġno": 359,
      "ĠI": 360,
      "Ġimplement": 361,
      "ĠF": 362,
      "ir": 363,
      "ow": 364,
      "act": 365,
      "ord": 366,
      "ue": 367,
      "Ġlen": 368,
      "Ġfor": 369,
      "Ġde": 370,
      "Ġnumbers": 371,
      "ation": 372,
      "ul": 373,
      "lement": 374,
      "Ġar": 375,
      "Ġreturns": 376,
      "ke": 377,
      "Ġ\"": 378,
      "Ġelement": 379,
      "ci": 380,
      "Ġ2": 381,
      "wo": 382,
      "Ġha": 383,
      "Ġon": 384,
      "rom": 385,
      "Ġinput": 386,
      "Ġma": 387,
      "Ġsing": 388,
      "Ġif": 389,
      "Ġall": 390,
      "Ġsingle": 391,
      "tive": 392,
      "ase": 393,
      "pe": 394,
      "der": 395,
      "it": 396,
      "Ġdiction": 397,
      "Ġsu": 398,
      "00": 399,
      "Ġpro": 400,
      "ine": 401,
      "Ġex": 402,
      "ding": 403,
      "Ġcha": 404,
      "ct": 405,
      "ind": 406,
      "ame": 407,
      "Ġfrom": 408,
      "Ġ-": 409,
      "quen": 410,
      "),": 411,
      "rite": 412,
      "Ġsor": 413,
      "nd": 414,
      "Ġorder": 415,
      "ĠP": 416,
      "Ġby": 417,
      "Ġtwo": 418,
      "Ġpo": 419,
      "Ġdictionary": 420,
      ").": 421,
      "Ġchar": 422,
      "us": 423,
      "Ġstrings": 424,
      "her": 425,
      "Ġth": 426,
      "Ġword": 427,
      "ĠIf": 428,
      "Ġne": 429,
      "key": 430,
      "Ġcom": 431,
      "ray": 432,
      "Ġwrite": 433,
      "id": 434,
      "Ġkey": 435,
      "Ġ[": 436,
      "Ġ=": 437,
      "Ġnot": 438,
      "Ġun": 439,
      "Ġ'": 440,
      "Ġcons": 441,
      "im": 442,
      "Ġelements": 443,
      "il": 444,
      "acters": 445,
      "ues": 446,
      "ib": 447,
      "Ġarray": 448,
      "Ġcharacters": 449,
      "nt": 450,
      "ther": 451,
      "ver": 452,
      "Ġany": 453,
      "Ġpri": 454,
      "Ġvalues": 455,
      "Ġra": 456,
      "int": 457,
      "Ġ3": 458,
      "lo": 459,
      "Ġsub": 460,
      "Ġy": 461,
      "ĠE": 462,
      "gth": 463,
      "est": 464,
      "ĠAn": 465,
      "Ġ0": 466,
      "Ġcontains": 467,
      "irst": 468,
      "quence": 469,
      "fi": 470,
      "Ġcontaining": 471,
      "ur": 472,
      "pac": 473,
      "ces": 474,
      "num": 475,
      "od": 476,
      "Ġfirst": 477,
      "ĠN": 478,
      "Ġal": 479,
      "iz": 480,
      "Ġlength": 481,
      "ch": 482,
      "uple": 483,
      "Ġsorted": 484,
      "Ġtasked": 485,
      "Ġtuple": 486,
      "yth": 487,
      "ython": 488,
      "ty": 489,
      "case": 490,
      "ĠPython": 491,
      "Ġconsist": 492,
      "Ġus": 493,
      "Ġthis": 494,
      "ĠĊ": 495,
      "Ġap": 496,
      "ise": 497,
      "ated": 498,
      "que": 499,
      "xt": 500,
      "arge": 501,
      "ĠR": 502,
      "per": 503,
      "Ġhand": 504,
      "Ġ<": 505,
      "Ġwords": 506,
      "to": 507,
      "cl": 508,
      "Ġvalue": 509,
      "Ġother": 510,
      "ff": 511,
      "Ġspac": 512,
      "term": 513,
      "Ġemp": 514,
      "Ġprime": 515,
      "Ġen": 516,
      "dd": 517,
      "ig": 518,
      "ique": 519,
      "Ġlists": 520,
      "age": 521,
      "Ġ\\": 522,
      "ree": 523,
      "Ġ<=": 524,
      "Ġme": 525,
      "Ġhandle": 526,
      "ion": 527,
      "ters": 528,
      "Ġ5": 529,
      "Ġimplementing": 530,
      "Ġnew": 531,
      "ng": 532,
      "Ġform": 533,
      "10": 534,
      "Ġ1000": 535,
      "Ġcomput": 536,
      "Ġwh": 537,
      "gest": 538,
      "Ġunique": 539,
      "ble": 540,
      "string": 541,
      "Ġdeterm": 542,
      "Ġsequence": 543,
      "Ġfind": 544,
      "Ġte": 545,
      "Ġ|": 546,
      "acci": 547,
      "onacci": 548,
      "Ġup": 549,
      "ibonacci": 550,
      "sitive": 551,
      "ates": 552,
      "Ġit": 553,
      "Ġkeys": 554,
      "one": 555,
      "Ġsum": 556,
      "alse": 557,
      "ower": 558,
      "ol": 559,
      "ĠRe": 560,
      "ust": 561,
      "Ġempty": 562,
      "ints": 563,
      "Ġres": 564,
      "Ġthan": 565,
      "Ġline": 566,
      "rue": 567,
      "Ġat": 568,
      "ori": 569,
      "ass": 570,
      "ative": 571,
      "Ġpa": 572,
      "wise": 573,
      "Ġcl": 574,
      "ĠFalse": 575,
      "str": 576,
      "Ġcan": 577,
      "arget": 578,
      "par": 579,
      "ive": 580,
      "Ġbo": 581,
      "alind": 582,
      "Ġusing": 583,
      "lic": 584,
      "cur": 585,
      "ĠTrue": 586,
      "mo": 587,
      "Ġtarget": 588,
      "ount": 589,
      "cen": 590,
      "Ġtheir": 591,
      "ma": 592,
      "ĠFibonacci": 593,
      "val": 594,
      "ting": 595,
      "imum": 596,
      "oll": 597,
      "red": 598,
      "Ġnon": 599,
      "ile": 600,
      "Ġlet": 601,
      "',": 602,
      "Ġdetermine": 603,
      "Ġsame": 604,
      "cending": 605,
      "co": 606,
      "Ġper": 607,
      "Ġonly": 608,
      "ollow": 609,
      "Ġlower": 610,
      "Ġits": 611,
      "Ġfollow": 612,
      "Ġcor": 613,
      "Ġvalid": 614,
      "nge": 615,
      "tw": 616,
      "rig": 617,
      "ĠC": 618,
      "Ġincl": 619,
      "Ġlowercase": 620,
      "Ġpalind": 621,
      "Ġda": 622,
      "Ġro": 623,
      "Ġclass": 624,
      "Ġotherwise": 625,
      "ctu": 626,
      "ffic": 627,
      "Ġmust": 628,
      "gra": 629,
      "ffici": 630,
      "twe": 631,
      "tween": 632,
      "Ġ4": 633,
      "Ġst": 634,
      "Ġcal": 635,
      "Ġbetween": 636,
      "ĠReturn": 637,
      "mal": 638,
      "sion": 639,
      "am": 640,
      "cul": 641,
      "Ġmo": 642,
      "Ġmax": 643,
      "ĠNone": 644,
      "con": 645,
      "Ġta": 646,
      "ren": 647,
      "Ġconsisting": 648,
      "gative": 649,
      "parated": 650,
      "Ġone": 651,
      "ses": 652,
      "fficient": 653,
      "Ġletters": 654,
      "peci": 655,
      "numb": 656,
      "Ġstr": 657,
      "rint": 658,
      "Ġnums": 659,
      "Ġpositive": 660,
      "ulti": 661,
      "ener": 662,
      "Ġyou": 663,
      "ds": 664,
      "thod": 665,
      "Ġfact": 666,
      "Ġspaces": 667,
      "Ġappe": 668,
      "ari": 669,
      "Ġformat": 670,
      "ity": 671,
      "Ġdo": 672,
      "fin": 673,
      "Ġrange": 674,
      "list": 675,
      "ĠS": 676,
      "for": 677,
      "inary": 678,
      "Ġappear": 679,
      "ating": 680,
      "Ġgener": 681,
      "Ġmethod": 682,
      "Ġsuch": 683,
      "Ġefficient": 684,
      "pon": 685,
      "ultip": 686,
      "vers": 687,
      "el": 688,
      "form": 689,
      "Ġconver": 690,
      "Ġspeci": 691,
      "Ġtext": 692,
      "ime": 693,
      "Ġbinary": 694,
      "tic": 695,
      "ht": 696,
      "Con": 697,
      "ror": 698,
      "Ġthese": 699,
      "rome": 700,
      "inal": 701,
      "ested": 702,
      "Ġpar": 703,
      "numbers": 704,
      "Ġarr": 705,
      "Ġk": 706,
      "Ġbu": 707,
      "ss": 708,
      "Ġmaximum": 709,
      "fined": 710,
      "Ġremo": 711,
      "Ġmultip": 712,
      "Ġac": 713,
      "Ġinclu": 714,
      "ations": 715,
      "Ġlon": 716,
      "gram": 717,
      "po": 718,
      "aints": 719,
      "Ġdata": 720,
      "Ġhave": 721,
      "Ġadd": 722,
      "Constr": 723,
      "ĠJ": 724,
      "Ġ100": 725,
      "mon": 726,
      "Ġcalcul": 727,
      "Ġx": 728,
      "ich": 729,
      "Ġdefined": 730,
      "Ġsecon": 731,
      "Ġresul": 732,
      "Ġmay": 733,
      "Ġflo": 734,
      "Ġnested": 735,
      "pha": 736,
      "uct": 737,
      "Ġwhich": 738,
      "Ġorig": 739,
      "Ġdist": 740,
      "ix": 741,
      "Ġh": 742,
      "Constraints": 743,
      "ize": 744,
      "Ġoutput": 745,
      "Ġtree": 746,
      "ution": 747,
      "Ġu": 748,
      "Ġhe": 749,
      "ĠEach": 750,
      "\",": 751,
      "Ġlongest": 752,
      "Ġinto": 753,
      "Ġfre": 754,
      "Ġtuples": 755,
      "Ġsol": 756,
      "lis": 757,
      "Ġascending": 758,
      "Ġfile": 759,
      "dic": 760,
      "Ġpalindrome": 761,
      "Ġtra": 762,
      "ect": 763,
      "ance": 764,
      "Ġcase": 765,
      "uplic": 766,
      "Ġthere": 767,
      "Ġtime": 768,
      "Ġoper": 769,
      "Ġoriginal": 770,
      "ven": 771,
      "Ġfollowing": 772,
      "rent": 773,
      "Ġuse": 774,
      "Ġstar": 775,
      "enti": 776,
      "pl": 777,
      "fied": 778,
      "].": 779,
      "respon": 780,
      "Ġhas": 781,
      "ne": 782,
      "ap": 783,
      "Ġcorrespon": 784,
      "its": 785,
      "enten": 786,
      "Ġdiv": 787,
      "ie": 788,
      "ĠImplement": 789,
      "Ġproces": 790,
      "dex": 791,
      "Ġsecond": 792,
      "ack": 793,
      "Ġseparated": 794,
      "Ġsubstring": 795,
      "ns": 796,
      "Ġboth": 797,
      "Ġnam": 798,
      "om": 799,
      "Ġapp": 800,
      "ally": 801,
      "Ġop": 802,
      "ear": 803,
      "Ġcorresponding": 804,
      "ound": 805,
      "Ġprod": 806,
      "lish": 807,
      "unctu": 808,
      "Ġalpha": 809,
      "unctuation": 810,
      "Ġsolution": 811,
      "ator": 812,
      "ON": 813,
      "orial": 814,
      "ĠB": 815,
      "Ġcompute": 816,
      "out": 817,
      "Ġdig": 818,
      "atu": 819,
      "SON": 820,
      "Ġcomputes": 821,
      "()": 822,
      "ĠJSON": 823,
      "ay": 824,
      "Ġmultiple": 825,
      "Ġid": 826,
      "Ġequ": 827,
      "'s": 828,
      "Ġduplic": 829,
      "ĠEng": 830,
      "Ġpres": 831,
      "ard": 832,
      "ition": 833,
      "ot": 834,
      "Ġpunctuation": 835,
      "ĠEnglish": 836,
      "Ġsubse": 837,
      "Ġname": 838,
      "rect": 839,
      "cy": 840,
      "ilt": 841,
      "Ġob": 842,
      "Ġremov": 843,
      "Ġfrequen": 844,
      "pri": 845,
      "Ġbuilt": 846,
      "\".": 847,
      "Ġcount": 848,
      "eric": 849,
      "trix": 850,
      "Ġ{": 851,
      "Ġrecur": 852,
      "Ġ\\(": 853,
      "Ġdes": 854,
      "Ġwithin": 855,
      "ess": 856,
      "thm": 857,
      "Ġnode": 858,
      "gn": 859,
      "Ġspace": 860,
      "Ġpre": 861,
      "gori": 862,
      "Ġindex": 863,
      "Ġoc": 864,
      "Ġfactorial": 865,
      "Ġwill": 866,
      "des": 867,
      "gorithm": 868,
      "Ġalgorithm": 869,
      "Ġlo": 870,
      "ok": 871,
      "Ġconsists": 872,
      "ĠTwo": 873,
      "Ġprogram": 874,
      "ast": 875,
      "entence": 876,
      "oun": 877,
      "Ġfunctions": 878,
      "Ġwithout": 879,
      "Ġr": 880,
      "cep": 881,
      "tem": 882,
      "argest": 883,
      "fies": 884,
      "qua": 885,
      "tes": 886,
      "Ġconsi": 887,
      "ases": 888,
      "Ġcommon": 889,
      "Ġcomp": 890,
      "Ġeven": 891,
      "ĠFor": 892,
      "ĠPrint": 893,
      "Ġmin": 894,
      "Ġobj": 895,
      "ĠU": 896,
      "Ġset": 897,
      "aries": 898,
      "tim": 899,
      "ented": 900,
      "Ġtak": 901,
      "Ġz": 902,
      "Ġend": 903,
      "Ġmatrix": 904,
      "Ġexist": 905,
      "Ġproduct": 906,
      "ad": 907,
      "word": 908,
      "Ġ6": 909,
      "negative": 910,
      "Ġcode": 911,
      "ĠD": 912,
      "ors": 913,
      "rence": 914,
      "Ġoccur": 915,
      "ĠO": 916,
      "Ġupper": 917,
      "Ġrevers": 918,
      "inct": 919,
      "be": 920,
      "Ġcomple": 921,
      "Ġidenti": 922,
      "ero": 923,
      "Ġ+": 924,
      "Ġdistinct": 925,
      "acter": 926,
      "000": 927,
      "Ġsort": 928,
      "Ġdoes": 929,
      "ck": 930,
      "Ġdigits": 931,
      "Ġdivis": 932,
      "Ġmod": 933,
      "Ġign": 934,
      "point": 935,
      "ced": 936,
      "Ġyour": 937,
      "Ġcases": 938,
      "Ġcol": 939,
      "Ġprocesses": 940,
      "Ġgenerate": 941,
      "Ġequal": 942,
      "rror": 943,
      "essage": 944,
      "Ġperform": 945,
      "Ġtakes": 946,
      "Ġspecified": 947,
      "Ġpl": 948,
      "Ġnegative": 949,
      "ĠW": 950,
      "cre": 951,
      "Error": 952,
      "Ġpair": 953,
      "sing": 954,
      "],": 955,
      "Ġcharacter": 956,
      "Ġuppercase": 957,
      "Ġsqua": 958,
      "sive": 959,
      "ide": 960,
      "Ġless": 961,
      "Ġlargest": 962,
      "mper": 963,
      "ab": 964,
      "mperatu": 965,
      "pec": 966,
      "Ġsmal": 967,
      "Ġcomplex": 968,
      "pression": 969,
      "Ġsentence": 970,
      "lest": 971,
      "Ġzero": 972,
      "so": 973,
      "ous": 974,
      "ĠH": 975,
      "Ġnth": 976,
      "able": 977,
      "et": 978,
      "fy": 979,
      "Ġoptim": 980,
      "Ġrepresented": 981,
      "ĠL": 982,
      "Ġfloating": 983,
      "count": 984,
      "Ġmessage": 985,
      "Ġthey": 986,
      "Ġresult": 987,
      "Ġfrequency": 988,
      "owel": 989,
      "Ġrepresents": 990,
      "verage": 991,
      "Ġefficiently": 992,
      "Ġappears": 993,
      "ater": 994,
      "ins": 995,
      "ines": 996,
      "Ġindic": 997,
      "ub": 998,
      "cimal": 999,
      "iti": 1000,
      "numeric": 1001,
      "Ġgre": 1002,
      "Ġrecursive": 1003,
      "ĠV": 1004,
      "Ġmer": 1005,
      "Ġ[-": 1006,
      "Ġdis": 1007,
      "Ġprov": 1008,
      "Ġaddres": 1009,
      "trib": 1010,
      "Ġstart": 1011,
      "ight": 1012,
      "tribut": 1013,
      "ace": 1014,
      "Ġobject": 1015,
      "ĠIn": 1016,
      "ft": 1017,
      "Ġer": 1018,
      "ized": 1019,
      "ign": 1020,
      "Ġprint": 1021,
      "Ġsmallest": 1022,
      "Ġyear": 1023,
      "text": 1024,
      "dered": 1025,
      "Ġexpression": 1026,
      "ument": 1027,
      "Ġbas": 1028,
      "ĠM": 1029,
      "Ġwe": 1030,
      "uctu": 1031,
      "fic": 1032,
      "ten": 1033,
      "Ġmat": 1034,
      "Ġpresent": 1035,
      "owels": 1036,
      "Ġcomplexity": 1037,
      "Ġ20": 1038,
      "Ġ7": 1039,
      "Ġnamed": 1040,
      "Ġinclude": 1041,
      "Ġtim": 1042,
      "Ġthree": 1043,
      "Ġoperations": 1044,
      "Ġtemperatu": 1045,
      "Ġrea": 1046,
      "Ġpos": 1047,
      "Ġconstr": 1048,
      "Ġattribut": 1049,
      "name": 1050,
      "Ġtimes": 1051,
      "ph": 1052,
      "Ġdictionaries": 1053,
      "Ġlarge": 1054,
      "Ġstructu": 1055,
      "ort": 1056,
      "Ġ8": 1057,
      "Ġexists": 1058,
      "Ġconsidered": 1059,
      "cta": 1060,
      "Ġdescending": 1061,
      "--": 1062,
      "ffe": 1063,
      "ctang": 1064,
      "cri": 1065,
      "Ġed": 1066,
      "betic": 1067,
      "Ġconvert": 1068,
      "les": 1069,
      "sition": 1070,
      "Ġfound": 1071,
      "Ġappro": 1072,
      "Ġgra": 1073,
      "pective": 1074,
      "Ġerror": 1075,
      "Ġpossi": 1076,
      "Ġrespective": 1077,
      "Ġqu": 1078,
      "Ġinter": 1079,
      "Ġcalculate": 1080,
      "dent": 1081,
      "Ġparame": 1082,
      "Ġcoun": 1083,
      "Ġincluding": 1084,
      "renthe": 1085,
      "Ġduplicate": 1086,
      "Ġpalindrom": 1087,
      "Ġgreater": 1088,
      "cts": 1089,
      "Ġsubsequence": 1090,
      "Ġallow": 1091,
      "our": 1092,
      "ure": 1093,
      "ward": 1094,
      "Ġmost": 1095,
      "Ġins": 1096,
      "usive": 1097,
      "ided": 1098,
      "Ġbal": 1099,
      "Ġextr": 1100,
      "Ġpath": 1101,
      "ĠG": 1102,
      "ps": 1103,
      "arch": 1104,
      "Ġcorrect": 1105,
      "Ġthem": 1106,
      "Ġaverage": 1107,
      "Ġty": 1108,
      "ctangle": 1109,
      "Ġitem": 1110,
      "Ġroot": 1111,
      "creas": 1112,
      "Ġbut": 1113,
      "loy": 1114,
      "Ġman": 1115,
      "tal": 1116,
      "Ġreads": 1117,
      "Ġremoved": 1118,
      "Ġarg": 1119,
      "Ġparenthe": 1120,
      "Ġexample": 1121,
      "ensitive": 1122,
      "creasing": 1123,
      "uth": 1124,
      "mail": 1125,
      "Ġposition": 1126,
      "Ġso": 1127,
      "main": 1128,
      "Ġaccep": 1129,
      "ĠVal": 1130,
      "Ġfl": 1131,
      "Ġpoint": 1132,
      "words": 1133,
      "separated": 1134,
      "Ġmodi": 1135,
      "Ġallowed": 1136,
      "value": 1137,
      "Ġdiffe": 1138,
      "ict": 1139,
      "atis": 1140,
      "uthor": 1141,
      "Ġsatis": 1142,
      "):": 1143,
      "No": 1144,
      "cut": 1145,
      "ĠValue": 1146,
      "Ġargument": 1147,
      "valid": 1148,
      "Ġback": 1149,
      "vel": 1150,
      "Ġprovided": 1151,
      "tudent": 1152,
      "Ġminimum": 1153,
      "ĠValueError": 1154,
      "ges": 1155,
      "oring": 1156,
      "Ġ\\)": 1157,
      "cha": 1158,
      "Ġsco": 1159,
      "Ġtotal": 1160,
      "nums": 1161,
      "Ġad": 1162,
      "Ġj": 1163,
      "right": 1164,
      "itle": 1165,
      "anced": 1166,
      "Ġleast": 1167,
      "Ġnodes": 1168,
      "Ġget": 1169,
      "ore": 1170,
      "ither": 1171,
      "Ġbased": 1172,
      "fix": 1173,
      "Ġpoints": 1174,
      "ee": 1175,
      "Ġtrans": 1176,
      "Ġalphabetic": 1177,
      "ping": 1178,
      "Ġlst": 1179,
      "Ġrequ": 1180,
      "Ġcounts": 1181,
      "Ġbook": 1182,
      "Ġenc": 1183,
      "ip": 1184,
      "ild": 1185,
      "dict": 1186,
      "Ġlea": 1187,
      "Ġmethods": 1188,
      "Ġalphanumeric": 1189,
      "Ġimplementation": 1190,
      "Ġ9": 1191,
      "Ġreverse": 1192,
      "Ġresulting": 1193,
      "insensitive": 1194,
      "Ġter": 1195,
      "crip": 1196,
      "Ġattributes": 1197,
      "quent": 1198,
      "Ġrow": 1199,
      "YY": 1200,
      "del": 1201,
      "Ġarea": 1202,
      "lication": 1203,
      "Ġwhether": 1204,
      "Ġconverts": 1205,
      "ving": 1206,
      "ndom": 1207,
      "Ġfloat": 1208,
      "Ġsy": 1209,
      "ordin": 1210,
      "..": 1211,
      "Ġsatisfies": 1212,
      "Ġvowels": 1213,
      "Ġodd": 1214,
      "Ġinterval": 1215,
      "Ġfil": 1216,
      "di": 1217,
      "Ġaddress": 1218,
      "Ġedge": 1219,
      "com": 1220,
      "Ġterm": 1221,
      ".,": 1222,
      "Ġnames": 1223,
      "Ġvari": 1224,
      "Ġexact": 1225,
      "Ġflat": 1226,
      "reate": 1227,
      "ner": 1228,
      "Ġpossible": 1229,
      "Ġeither": 1230,
      "Ġraise": 1231,
      "Ġsta": 1232,
      "Ġmain": 1233,
      "Ġcalculates": 1234,
      "Ġsquare": 1235,
      "itial": 1236,
      "\":": 1237,
      "and": 1238,
      "Ġright": 1239,
      "Ġpalindromic": 1240,
      "Ġ12": 1241,
      "util": 1242,
      "Ġprice": 1243,
      "Ġsto": 1244,
      "cutive": 1245,
      "secutive": 1246,
      "Ġgr": 1247,
      "'.": 1248,
      "ards": 1249,
      "Ġemail": 1250,
      "ĠAdd": 1251,
      "Ġfollows": 1252,
      "Ġsearch": 1253,
      "Ġutil": 1254,
      "Ġstudent": 1255,
      "Ġduplicates": 1256,
      "sed": 1257,
      "ks": 1258,
      "Ġwhile": 1259,
      "Ġleft": 1260,
      "Ġinclusive": 1261,
      "Ġheight": 1262,
      "Ġformatted": 1263,
      "ies": 1264,
      "gu": 1265,
      "fter": 1266,
      "Ġdecimal": 1267,
      "Ġignoring": 1268,
      "Ġexactly": 1269,
      "Ġalso": 1270,
      "Ġparameters": 1271,
      "Ġoptimized": 1272,
      "Ġrandom": 1273,
      "Ġclo": 1274,
      "Ġindices": 1275,
      "ume": 1276,
      "Ġcoordin": 1277,
      "Ġrectangle": 1278,
      "Ġconsecutive": 1279,
      "igh": 1280,
      "Ġoccurrence": 1281,
      "ull": 1282,
      "tern": 1283,
      "12": 1284,
      "Ġidentifies": 1285,
      "tan": 1286,
      "lean": 1287,
      "Ġbalanced": 1288,
      "prime": 1289,
      "Ġstructure": 1290,
      "Ġden": 1291,
      "Ġtemperature": 1292,
      "rac": 1293,
      "Ġiter": 1294,
      "loyee": 1295,
      "Ġch": 1296,
      "Ġbase": 1297,
      "Ġfe": 1298,
      "Ġmore": 1299,
      "arr": 1300,
      "Ġremain": 1301,
      "cript": 1302,
      "Ġstack": 1303,
      "Ġ->": 1304,
      "issing": 1305,
      "Ġab": 1306,
      "ell": 1307,
      "Ġlevel": 1308,
      "Implement": 1309,
      "Ġsorting": 1310,
      "Ġsize": 1311,
      "Ġmerge": 1312,
      "edi": 1313,
      "pace": 1314,
      "Ġcolum": 1315,
      "Ġinputs": 1316,
      "Ġdistance": 1317,
      "Ġremove": 1318,
      "Ġdate": 1319,
      "ieve": 1320,
      "The": 1321,
      "Ġens": 1322,
      "rences": 1323,
      "ink": 1324,
      "ming": 1325,
      "Ġ50": 1326,
      "Ġmaintain": 1327,
      "II": 1328,
      "da": 1329,
      "Ġcoordinates": 1330,
      "Ġtitle": 1331,
      "wards": 1332,
      "Ġ>": 1333,
      "ization": 1334,
      "Ġleading": 1335,
      "Ġsup": 1336,
      "Ġlog": 1337,
      "Ġparentheses": 1338,
      "heck": 1339,
      "Ġpr": 1340,
      "Ġday": 1341,
      "ites": 1342,
      "Ġcur": 1343,
      "Ġflatten": 1344,
      "RL": 1345,
      "Ġrequi": 1346,
      "Ġuser": 1347,
      "Ġsorts": 1348,
      "imit": 1349,
      "hen": 1350,
      "Ġdirect": 1351,
      "Ġmodel": 1352,
      "ory": 1353,
      "Ġser": 1354,
      "hest": 1355,
      "Ġspecific": 1356,
      "itespace": 1357,
      "ĠURL": 1358,
      "1000": 1359,
      "ucts": 1360,
      "Ġmissing": 1361,
      "cies": 1362,
      "Ġfactors": 1363,
      "Ġafter": 1364,
      "__": 1365,
      "Ġ$": 1366,
      "itionally": 1367,
      "Ġdivision": 1368,
      "SC": 1369,
      "':": 1370,
      "ĠTh": 1371,
      "Ġ(-": 1372,
      "Ġover": 1373,
      "mut": 1374,
      "ook": 1375,
      "bin": 1376,
      "Ġpreser": 1377,
      "Ġarrays": 1378,
      "Ġinitial": 1379,
      "input": 1380,
      "Ġstarting": 1381,
      "Ġonce": 1382,
      "wer": 1383,
      "tical": 1384,
      "Ġpairs": 1385,
      "ĠIP": 1386,
      "Ġhig": 1387,
      "Ġinvalid": 1388,
      "Ġsubstrings": 1389,
      "Ġam": 1390,
      "SCII": 1391,
      "Ġwhitespace": 1392,
      "Ġvers": 1393,
      "inked": 1394,
      "Ġinstan": 1395,
      "cord": 1396,
      "fact": 1397,
      "array": 1398,
      "Ġutilize": 1399,
      "ST": 1400,
      "Ġrepresentation": 1401,
      "Ġtype": 1402,
      "son": 1403,
      "ML": 1404,
      "Ġfilter": 1405,
      "emp": 1406,
      "ose": 1407,
      "ĠASCII": 1408,
      ".\"": 1409,
      "leq": 1410,
      "ield": 1411,
      "av": 1412,
      "sius": 1413,
      "ery": 1414,
      "Ġdetermines": 1415,
      "iling": 1416,
      "Ġlast": 1417,
      "Ġtravers": 1418,
      "Ġincreasing": 1419,
      "():": 1420,
      "Ġintervals": 1421,
      "Ġversion": 1422,
      "Ġdeno": 1423,
      "data": 1424,
      "Ġloo": 1425,
      "ĠAdditionally": 1426,
      "Ġtake": 1427,
      "Ġexcep": 1428,
      "Ġnext": 1429,
      "ssume": 1430,
      "Ġbrac": 1431,
      "Ġaddition": 1432,
      "ice": 1433,
      "ex": 1434,
      "ĠDe": 1435,
      "Ġwhen": 1436,
      "Ġsublist": 1437,
      "blem": 1438,
      "cle": 1439,
      "element": 1440,
      "Ġcheck": 1441,
      "edian": 1442,
      "Ġcorrectly": 1443,
      "Ġtop": 1444,
      "Ġout": 1445,
      "Ġcap": 1446,
      "Ġsupp": 1447,
      "Ġpermut": 1448,
      "quences": 1449,
      "},": 1450,
      "nged": 1451,
      "Ġtest": 1452,
      "ders": 1453,
      "Ġ/": 1454,
      "Ġauthor": 1455,
      "Ġhex": 1456,
      "cor": 1457,
      "ĠWrite": 1458,
      "ĠX": 1459,
      "ĠAssume": 1460,
      "Ġhighest": 1461,
      "Ex": 1462,
      "cted": 1463,
      "ĠHT": 1464,
      "Ġrota": 1465,
      "sions": 1466,
      "Ġcombin": 1467,
      "Given": 1468,
      "Ġproblem": 1469,
      "Ġfrequencies": 1470,
      "ico": 1471,
      "Ġlines": 1472,
      "Ġmake": 1473,
      "Ġna": 1474,
      "Ġcurrent": 1475,
      "Ġrequired": 1476,
      "Ġprefix": 1477,
      "Ġdict": 1478,
      "tions": 1479,
      "Ġspecial": 1480,
      "Ġlinked": 1481,
      "Ġgenerates": 1482,
      "Ġlimit": 1483,
      "Ġconc": 1484,
      "Ġapproach": 1485,
      "Ġprogramming": 1486,
      "Ġconsider": 1487,
      "Ġfewer": 1488,
      "Ġcomm": 1489,
      "Ġnumeric": 1490,
      "Ġforward": 1491,
      "ale": 1492,
      "Ġmodified": 1493,
      "Ġneed": 1494,
      "ility": 1495,
      "priate": 1496,
      "Ġpat": 1497,
      "MM": 1498,
      "Ġappropriate": 1499,
      "ork": 1500,
      "agram": 1501,
      "very": 1502,
      "ĠThis": 1503,
      "ant": 1504,
      "Ġsquares": 1505,
      "Ġcar": 1506,
      "empty": 1507,
      "Ġdep": 1508,
      "Ġunders": 1509,
      "cess": 1510,
      "Ġtri": 1511,
      "yp": 1512,
      "play": 1513,
      "Ġrecursion": 1514,
      "Ġsi": 1515,
      "Ġtrailing": 1516,
      "dition": 1517,
      "Ġaccept": 1518,
      "Ġperformance": 1519,
      "Ġbracke": 1520,
      "Ġ\\).": 1521,
      "Ġpreserving": 1522,
      "Ġwid": 1523,
      "ah": 1524,
      "order": 1525,
      "ibr": 1526,
      "Ġconverted": 1527,
      "Ġinstance": 1528,
      "Ġwidth": 1529,
      "Ġdiscount": 1530,
      "gh": 1531,
      "ĠHTML": 1532,
      "by": 1533,
      "Ġbackward": 1534,
      "decimal": 1535,
      "Ġfactor": 1536,
      "tural": 1537,
      "lst": 1538,
      "Ġgraph": 1539,
      "Ġmar": 1540,
      "Ġcir": 1541,
      "Ġtransform": 1542,
      "place": 1543,
      "Ġcreate": 1544,
      "heit": 1545,
      "renheit": 1546,
      "ahrenheit": 1547,
      "Ġlibr": 1548,
      "clu": 1549,
      "graph": 1550,
      "olean": 1551,
      "alary": 1552,
      "Ġanagram": 1553,
      "ights": 1554,
      "Ġitems": 1555,
      "of": 1556,
      "Ġletter": 1557,
      "ute": 1558,
      "Ġcondition": 1559,
      "ves": 1560,
      "velo": 1561,
      "Ġach": 1562,
      "elf": 1563,
      "ĠIPv": 1564,
      "Ġevery": 1565,
      "ĠBook": 1566,
      "Ġtraversal": 1567,
      "izes": 1568,
      "ature": 1569,
      "elsius": 1570,
      "Ġitself": 1571,
      "ĠY": 1572,
      "ho": 1573,
      "Ġboolean": 1574,
      "ough": 1575,
      "Ġdifference": 1576,
      "Ġoccurrences": 1577,
      "Ġ25": 1578,
      "Ġthen": 1579,
      "Ġscore": 1580,
      "Ġnatural": 1581,
      "art": 1582,
      "elements": 1583,
      "Ġmedian": 1584,
      "Ġensure": 1585,
      "full": 1586,
      "here": 1587,
      "cent": 1588,
      "Ġround": 1589,
      "tric": 1590,
      "len": 1591,
      "led": 1592,
      "Ġextrac": 1593,
      "Ġfrequent": 1594,
      "Ġpattern": 1595,
      "Ġinner": 1596,
      "mb": 1597,
      "sis": 1598,
      "Note": 1599,
      "ceed": 1600,
      "cores": 1601,
      "Ġprices": 1602,
      "Ġdenotes": 1603,
      "Ġscores": 1604,
      "li": 1605,
      "Ġaccepts": 1606,
      "Ġconstruct": 1607,
      "gs": 1608,
      "Ġhexa": 1609,
      "sor": 1610,
      "Write": 1611,
      "Ġmaintaining": 1612,
      "ning": 1613,
      "Ġtre": 1614,
      "strings": 1615,
      "uring": 1616,
      "Ġint": 1617,
      "Ġemployee": 1618,
      "Ġarguments": 1619,
      "Ġextract": 1620,
      "cording": 1621,
      "Ġdepth": 1622,
      "alpha": 1623,
      "sub": 1624,
      "rid": 1625,
      "ava": 1626,
      "Ġdisplay": 1627,
      "Ġgo": 1628,
      "fully": 1629,
      "Ġrun": 1630,
      "Ġreversed": 1631,
      "max": 1632,
      "----": 1633,
      "Ġsequences": 1634,
      "aces": 1635,
      "Ġamount": 1636,
      "Ġaccording": 1637,
      "Ġscript": 1638,
      "Ġage": 1639,
      "pa": 1640,
      "Ġappearance": 1641,
      "time": 1642,
      "Ġhexadecimal": 1643,
      "vent": 1644,
      "ple": 1645,
      "Ġru": 1646,
      "hed": 1647,
      "date": 1648,
      "Ġpreced": 1649,
      "Ġoperator": 1650,
      "ical": 1651,
      "Ġreg": 1652,
      "ling": 1653,
      "Ġremoves": 1654,
      "end": 1655,
      "ability": 1656,
      "aten": 1657,
      "year": 1658,
      "25": 1659,
      "Ġexceed": 1660,
      "gle": 1661,
      "Ġmatter": 1662,
      "Ġtemperatures": 1663,
      "Ġrepe": 1664,
      "ĠCelsius": 1665,
      "fe": 1666,
      "Ġmean": 1667,
      "99": 1668,
      "**": 1669,
      "Ġsubarray": 1670,
      "ments": 1671,
      "lap": 1672,
      "Ġ15": 1673,
      "ird": 1674,
      "even": 1675,
      "Ġfour": 1676,
      "Ġvalidate": 1677,
      "ats": 1678,
      "Ġproper": 1679,
      "bly": 1680,
      "Ġsn": 1681,
      "Ġperforms": 1682,
      "entences": 1683,
      "common": 1684,
      "Ġplay": 1685,
      "Ġver": 1686,
      "Ġadj": 1687,
      "Ġdigit": 1688,
      "nging": 1689,
      "Ġpower": 1690,
      "Ġfunctional": 1691,
      "ords": 1692,
      "])": 1693,
      "changed": 1694,
      "Ġoperation": 1695,
      "Ġcolor": 1696,
      "thme": 1697,
      "Ġreturning": 1698,
      "Ġunchanged": 1699,
      "thmetic": 1700,
      "Ġbuild": 1701,
      "fect": 1702,
      "version": 1703,
      "Ġremoving": 1704,
      "nam": 1705,
      "Ġaddresses": 1706,
      "ular": 1707,
      "rithmetic": 1708,
      "action": 1709,
      "are": 1710,
      "own": 1711,
      "Ġconcaten": 1712,
      "Ġidentify": 1713,
      "Ġtyp": 1714,
      "other": 1715,
      "Ġwri": 1716,
      "Ġread": 1717,
      "Ġarithmetic": 1718,
      "Ġchild": 1719,
      "sum": 1720,
      "Ġgrace": 1721,
      ":**": 1722,
      "Ġgracefully": 1723,
      "imeter": 1724,
      "Ġgrou": 1725,
      "ays": 1726,
      "stem": 1727,
      "Ġyield": 1728,
      "ĠReturns": 1729,
      "ze": 1730,
      "Ġ'(": 1731,
      "palind": 1732,
      "Ġconstructs": 1733,
      "Ġ')": 1734,
      "vi": 1735,
      "orld": 1736,
      "ĠCS": 1737,
      "Ġsc": 1738,
      "Ġca": 1739,
      "Ġsim": 1740,
      "length": 1741,
      "fore": 1742,
      "soci": 1743,
      "ĠWords": 1744,
      "Ġcont": 1745,
      "Your": 1746,
      "Ġseconds": 1747,
      "ĠJava": 1748,
      "Ġanagrams": 1749,
      "Ġdirectly": 1750,
      "Ġassoci": 1751,
      "Ġmodify": 1752,
      "Ġgrid": 1753,
      "ĠNo": 1754,
      "Ġcolumn": 1755,
      "Ġsalary": 1756,
      "number": 1757,
      "Ġgenerator": 1758,
      "ded": 1759,
      "Ġerrors": 1760,
      "Ġplaces": 1761,
      "ped": 1762,
      "Ġrules": 1763,
      "Ġthird": 1764,
      "ello": 1765,
      "Ġfra": 1766,
      "tigu": 1767,
      "tiguous": 1768,
      "Ġrows": 1769,
      "Ġvariable": 1770,
      "Ġquery": 1771,
      "ake": 1772,
      "queue": 1773,
      "ored": 1774,
      "sequence": 1775,
      "Ġignore": 1776,
      "Ġanother": 1777,
      "pro": 1778,
      "Ġdifferent": 1779,
      "Ġ{\"": 1780,
      "Ġcontiguous": 1781,
      "div": 1782,
      "ible": 1783,
      "ils": 1784,
      "Ġperfect": 1785,
      "Ġvary": 1786,
      "ĠCar": 1787,
      "Ġassociated": 1788,
      "(\"": 1789,
      "Ġterms": 1790,
      "Ġlex": 1791,
      "Ġdivisors": 1792,
      "Ġreturned": 1793,
      "ong": 1794,
      "Ġsw": 1795,
      "decreasing": 1796,
      "izing": 1797,
      "Ġachieve": 1798,
      "Ġloops": 1799,
      "Ġsimple": 1800,
      "20": 1801,
      "Ġparti": 1802,
      "line": 1803,
      "sorted": 1804,
      "Ġsome": 1805,
      "Ġstructures": 1806,
      "ects": 1807,
      "Ġtable": 1808,
      "Ġprocess": 1809,
      "Ġbuilding": 1810,
      "ignature": 1811,
      "Ġformed": 1812,
      "ĠID": 1813,
      "Ġindicating": 1814,
      "Ġabs": 1815,
      "men": 1816,
      "Ġmarks": 1817,
      "icograph": 1818,
      "123": 1819,
      "Ġlengths": 1820,
      "not": 1821,
      "centage": 1822,
      "Ġsystem": 1823,
      "Ġlexicograph": 1824,
      "Ġnumer": 1825,
      "Ġmap": 1826,
      "Ġvarious": 1827,
      "Ġtypes": 1828,
      "alcul": 1829,
      "ities": 1830,
      "XX": 1831,
      "Ġpreceding": 1832,
      "Ġunit": 1833,
      "Ġstrict": 1834,
      "Ġdivide": 1835,
      "Ġgu": 1836,
      "Ġopen": 1837,
      "tered": 1838,
      "Ġlibraries": 1839,
      "start": 1840,
      "termine": 1841,
      "Ġrais": 1842,
      "read": 1843,
      "De": 1844,
      "erson": 1845,
      "Ġcompre": 1846,
      "ia": 1847,
      "ĠFahrenheit": 1848,
      "19": 1849,
      "Ġ..": 1850,
      "ustom": 1851,
      "Ġcompar": 1852,
      "Ġunderscores": 1853,
      "hes": 1854,
      "Ġdecor": 1855,
      "Ġwriting": 1856,
      "Ġextracts": 1857,
      "Ġroll": 1858,
      "Ġav": 1859,
      "Ġgame": 1860,
      "Ġapplication": 1861,
      "ĠCon": 1862,
      "Ġaccount": 1863,
      "45": 1864,
      "Ġperimeter": 1865,
      "ĠIt": 1866,
      "Ġmemo": 1867,
      "Ġstrictly": 1868,
      "Ġbefore": 1869,
      "Ġdimen": 1870,
      "Ġrespectively": 1871,
      "sentence": 1872,
      "Ġsets": 1873,
      "txt": 1874,
      "Ġignored": 1875,
      "ital": 1876,
      "Ġmatch": 1877,
      "Ġrounded": 1878,
      "Ġoptimize": 1879,
      "Ġsentences": 1880,
      "all": 1881,
      "Function": 1882,
      "Ġsubsequent": 1883,
      "ĠK": 1884,
      "Ġparenthesis": 1885,
      "Ġfollowed": 1886,
      "ucl": 1887,
      "Ġzeros": 1888,
      "Ġadditional": 1889,
      "Ġpub": 1890,
      "uclide": 1891,
      "ĠBST": 1892,
      "ection": 1893,
      "uclidean": 1894,
      "Ġbrackets": 1895,
      "integ": 1896,
      "Ġ30": 1897,
      "Ġpositions": 1898,
      "Ġremaining": 1899,
      "ura": 1900,
      "Ġmerg": 1901,
      "Ġli": 1902,
      "ĠUse": 1903,
      "Ġconsidering": 1904,
      "Ġph": 1905,
      "char": 1906,
      "fo": 1907,
      "json": 1908,
      "palindrome": 1909,
      "ĠDetermine": 1910,
      "lf": 1911,
      "ĠEuclidean": 1912,
      "Hello": 1913,
      "Ġcolumns": 1914,
      "Ġbackwards": 1915,
      "Ġste": 1916,
      "Ġforwards": 1917,
      "base": 1918,
      "tails": 1919,
      "Ġconversion": 1920,
      "Ġmemoization": 1921,
      "Ġradi": 1922,
      "low": 1923,
      "tit": 1924,
      "valu": 1925,
      "olute": 1926,
      "100": 1927,
      "Ġpot": 1928,
      "ĠSignature": 1929,
      "ĠCSV": 1930,
      "Ġpotenti": 1931,
      "ison": 1932,
      "Ġexclu": 1933,
      "Ġparse": 1934,
      "Ġweb": 1935,
      "Ġadjac": 1936,
      "Ġswap": 1937,
      "Ġstock": 1938,
      "Ġidentifi": 1939,
      "Ġexe": 1940,
      "Ġpermutation": 1941,
      "Ġinters": 1942,
      "Ġvis": 1943,
      "().": 1944,
      "Ġprints": 1945,
      "Ġsimul": 1946,
      "Ġiterative": 1947,
      "oth": 1948,
      "Ġable": 1949,
      "Ġhandling": 1950,
      "Ġwell": 1951,
      "Ġformul": 1952,
      "Ġfinal": 1953,
      "Ġimp": 1954,
      "fit": 1955,
      "duplic": 1956,
      "Ġabsolute": 1957,
      "Ġfinds": 1958,
      "Ġcomparison": 1959,
      "Ġgoal": 1960,
      "Ġobjects": 1961,
      "ule": 1962,
      "hell": 1963,
      "Ġsolve": 1964,
      "assi": 1965,
      "')": 1966,
      "ages": 1967,
      "Ġused": 1968,
      "//": 1969,
      "Ġcapital": 1970,
      "ency": 1971,
      "lapping": 1972,
      "nsure": 1973,
      "Ġdimensions": 1974,
      "ents": 1975,
      "Ġthose": 1976,
      "Ġparameter": 1977,
      "ĠTree": 1978,
      "oc": 1979,
      "Ġfibonacci": 1980,
      "Node": 1981,
      "Ġ#": 1982,
      "Ġevalu": 1983,
      "hema": 1984,
      "sest": 1985,
      "angu": 1986,
      "fre": 1987,
      "}.": 1988,
      "hold": 1989,
      "Ġdou": 1990,
      "Ġopening": 1991,
      "min": 1992,
      "16": 1993,
      "Ġcri": 1994,
      "Ġmultiplication": 1995,
      "mes": 1996,
      "\")": 1997,
      "ivale": 1998,
      "def": 1999,
      "Ġexpon": 2000,
      "Ġnumeral": 2001,
      "ite": 2002,
      "Ġclosing": 2003,
      "Ġdoc": 2004,
      "Ġequivale": 2005,
      "aran": 2006,
      "ag": 2007,
      "Ġrepl": 2008,
      "Ġevent": 2009,
      "66": 2010,
      "YYYY": 2011,
      "Ġdesign": 2012,
      "Ġshi": 2013,
      "arante": 2014,
      "ĠEnsure": 2015,
      "ision": 2016,
      "Ġred": 2017,
      "Ġinser": 2018,
      "mbol": 2019,
      "Ġsupport": 2020,
      "largest": 2021,
      "ties": 2022,
      "Ġcustom": 2023,
      "abc": 2024,
      "dig": 2025,
      "Ġones": 2026,
      "Ġclassi": 2027,
      "Ġguarante": 2028,
      "htt": 2029,
      "log": 2030,
      "arra": 2031,
      "Ġformula": 2032,
      "Ġoperators": 2033,
      "ser": 2034,
      "ved": 2035,
      "Ġhow": 2036,
      "plan": 2037,
      "ways": 2038,
      "Ġgrades": 2039,
      "Ġtags": 2040,
      "Ġlike": 2041,
      "Ġplan": 2042,
      "DD": 2043,
      "Ġ32": 2044,
      "Ġprofit": 2045,
      "ob": 2046,
      "Ġheights": 2047,
      "Ġalways": 2048,
      "Ġpass": 2049,
      "ual": 2050,
      "Ġintersection": 2051,
      "([": 2052,
      "Ġbit": 2053,
      "Ġcateg": 2054,
      "QL": 2055,
      "hello": 2056,
      "Ġcriter": 2057,
      "Ġcomprehen": 2058,
      "Ġprin": 2059,
      "duplicates": 2060,
      "Ġsymbol": 2061,
      "CD": 2062,
      "Ġencoun": 2063,
      "Ġmodule": 2064,
      "Ġrearra": 2065,
      "Ġattribute": 2066,
      "Ġdevelo": 2067,
      "Ġ__": 2068,
      "tiv": 2069,
      "Ġbalance": 2070,
      "Ġmy": 2071,
      "ĠTreeNode": 2072,
      "))": 2073,
      "formation": 2074,
      "18": 2075,
      "Ġmerged": 2076,
      "Ġequivalent": 2077,
      "orts": 2078,
      "Ġbasic": 2079,
      "Ġsha": 2080,
      "Ġsepar": 2081,
      "Ġmathema": 2082,
      "test": 2083,
      "lished": 2084,
      "reshold": 2085,
      "alculator": 2086,
      "Ġ{'": 2087,
      "Ġlangu": 2088,
      "Ġsa": 2089,
      "table": 2090,
      "Create": 2091,
      "ĠGiven": 2092,
      "ep": 2093,
      "ith": 2094,
      "Ġpossibly": 2095,
      "Ġdecorator": 2096,
      "Ġvect": 2097,
      "planation": 2098,
      "Ġseries": 2099,
      "Ġcriteria": 2100,
      "atase": 2101,
      "ĠTo": 2102,
      "Ġpart": 2103,
      "Ġ('": 2104,
      "Ġ[]": 2105,
      "info": 2106,
      "Ġ\"\"": 2107,
      "hens": 2108,
      "cular": 2109,
      "Ġsign": 2110,
      "Ġreplac": 2111,
      "ĠRemo": 2112,
      "Ġguaranteed": 2113,
      "Ġgrade": 2114,
      "Ġprovide": 2115,
      "Ġexcept": 2116,
      "hat": 2117,
      "sort": 2118,
      "Ġmathematical": 2119,
      "rough": 2120,
      "oman": 2121,
      "Ġsubtr": 2122,
      "CS": 2123,
      "Ġpotential": 2124,
      "Ġstand": 2125,
      "clusive": 2126,
      "Ġranging": 2127,
      "Ġexten": 2128,
      "Ġdivisible": 2129,
      "Ġencountered": 2130,
      "|,": 2131,
      "Ġstudents": 2132,
      "hn": 2133,
      "ain": 2134,
      "Ġpalindromes": 2135,
      "ĠList": 2136,
      "ryp": 2137,
      "Ġrel": 2138,
      "Ġthrough": 2139,
      "Ġcircle": 2140,
      "vious": 2141,
      "han": 2142,
      "ĠRoman": 2143,
      "vowels": 2144,
      "ĠUn": 2145,
      "Ġflattened": 2146,
      "mployee": 2147,
      "ides": 2148,
      "Ġresults": 2149,
      "Ġpercentage": 2150,
      "ial": 2151,
      "oid": 2152,
      "Ġhead": 2153,
      "Ġdef": 2154,
      "Ġcre": 2155,
      "Ġ255": 2156,
      "Ġclean": 2157,
      "Ġperson": 2158,
      "Ġthreshold": 2159,
      "Ġcalc": 2160,
      "ru": 2161,
      "Ġdetails": 2162,
      "://": 2163,
      "bi": 2164,
      "file": 2165,
      "Example": 2166,
      "ically": 2167,
      "Ġstarts": 2168,
      "cal": 2169,
      "Ġdatase": 2170,
      "Ġhyp": 2171,
      "SB": 2172,
      "Ġinformation": 2173,
      "Ġenti": 2174,
      "gre": 2175,
      "Ġnecess": 2176,
      "Ġregular": 2177,
      "part": 2178,
      "Ġprevious": 2179,
      "Ġdy": 2180,
      "Ġsele": 2181,
      "Ġstate": 2182,
      "Ġ...,": 2183,
      "Ġcombinations": 2184,
      "idd": 2185,
      "tivity": 2186,
      "price": 2187,
      "Ġapply": 2188,
      "ence": 2189,
      "Script": 2190,
      "tead": 2191,
      "ĠRectangle": 2192,
      "values": 2193,
      "pected": 2194,
      "Ġ16": 2195,
      "Ġdele": 2196,
      "Ġdays": 2197,
      "ger": 2198,
      "Ġplayer": 2199,
      "Ġpermutations": 2200,
      "less": 2201,
      "tamp": 2202,
      "Ġgroup": 2203,
      "Ġdynam": 2204,
      "Ġradius": 2205,
      "Ġsen": 2206,
      "Ġcommas": 2207,
      "Ġclosest": 2208,
      "index": 2209,
      "Ġwas": 2210,
      "code": 2211,
      "Ġspl": 2212,
      "(),": 2213,
      "ult": 2214,
      "Ġdivisor": 2215,
      "Ġcombination": 2216,
      "Ġdice": 2217,
      "Ġhour": 2218,
      "Ġqueue": 2219,
      "lon": 2220,
      "Ġfrequently": 2221,
      "bitr": 2222,
      "Ġexcluding": 2223,
      "os": 2224,
      "Ġarbitr": 2225,
      "Ġpop": 2226,
      "Ġwould": 2227,
      "Ġmon": 2228,
      "indow": 2229,
      "11": 2230,
      "For": 2231,
      "Ġsupports": 2232,
      "Ġstandard": 2233,
      "size": 2234,
      "ĠEmployee": 2235,
      "py": 2236,
      "ĠJavaScript": 2237,
      "entical": 2238,
      "SBN": 2239,
      "pose": 2240,
      "nges": 2241,
      "ĠEx": 2242,
      "mong": 2243,
      "Ġjson": 2244,
      "unique": 2245,
      "NA": 2246,
      "ĠAuthor": 2247,
      "Ġ,": 2248,
      "ĠNote": 2249,
      "Ġnumerical": 2250,
      "ippe": 2251,
      "factor": 2252,
      "01": 2253,
      "title": 2254,
      "ĠSQL": 2255,
      "Ġcall": 2256,
      "item": 2257,
      "average": 2258,
      "ference": 2259,
      "Ġconditions": 2260,
      "ually": 2261,
      "ĠYear": 2262,
      "umul": 2263,
      "over": 2264,
      "trices": 2265,
      "ill": 2266,
      "Ġalong": 2267,
      "PI": 2268,
      "Ġidentical": 2269,
      "tices": 2270,
      "Ġamong": 2271,
      "where": 2272,
      "fibonacci": 2273,
      "Ġcompon": 2274,
      "Ġarbitrary": 2275,
      "Ġduring": 2276,
      "Ġ`": 2277,
      "Ġmerges": 2278,
      "Ġfloats": 2279,
      "Ġdots": 2280,
      "Ġraising": 2281,
      "bal": 2282,
      "168": 2283,
      "aly": 2284,
      "til": 2285,
      "Ġincre": 2286,
      "78": 2287,
      "Ġcannot": 2288,
      "ĠHow": 2289,
      "tant": 2290,
      "Ġidentifier": 2291,
      "Ġcard": 2292,
      "row": 2293,
      "Ġappropriately": 2294,
      "Ġbeing": 2295,
      "Ġ123": 2296,
      "integer": 2297,
      "col": 2298,
      "ca": 2299,
      "sitivity": 2300,
      "Ġtrian": 2301,
      "oded": 2302,
      "Ġemploy": 2303,
      "Ġmeaning": 2304,
      "23": 2305,
      "inclusive": 2306,
      "ippet": 2307,
      "alphanumeric": 2308,
      "Ġtie": 2309,
      "Ġensuring": 2310,
      "15": 2311,
      "Ġgenerated": 2312,
      "ĠAPI": 2313,
      "Ġmatrices": 2314,
      "Ġ[\"": 2315,
      "192": 2316,
      "ĠISBN": 2317,
      "SS": 2318,
      "Des": 2319,
      "Ġseg": 2320,
      "cution": 2321,
      "Ġnor": 2322,
      "Ġtimestamp": 2323,
      "sthen": 2324,
      "sthenes": 2325,
      "Ġdescri": 2326,
      "Ġ==": 2327,
      "comp": 2328,
      "iddle": 2329,
      "Ġplane": 2330,
      "Ġyears": 2331,
      "Ġdeveloping": 2332,
      "ĊĊ": 2333,
      "Ġrespon": 2334,
      "Explanation": 2335,
      "factors": 2336,
      "ever": 2337,
      "Ġcontent": 2338,
      "tree": 2339,
      "ove": 2340,
      "duct": 2341,
      "Ġtr": 2342,
      "Ġ')',": 2343,
      "Ġsole": 2344,
      "Ġunsorted": 2345,
      "Ġmix": 2346,
      "ross": 2347,
      "Ġbuildings": 2348,
      "Ġcell": 2349,
      "utes": 2350,
      "Ġdirectory": 2351,
      "ĠOther": 2352,
      "Ġconstructor": 2353,
      "Ġcompe": 2354,
      "Ġsolely": 2355,
      "frequen": 2356,
      "Ġalphabetical": 2357,
      "alphabetic": 2358,
      "Ġrob": 2359,
      "amel": 2360,
      "Ġcommand": 2361,
      "primes": 2362,
      "Ġwork": 2363,
      "Ġ19": 2364,
      "Ġlanguage": 2365,
      "Ġadhere": 2366,
      "partment": 2367,
      "Ġencryp": 2368,
      "digit": 2369,
      "Ġdataset": 2370,
      "Ġreadability": 2371,
      "add": 2372,
      "Ġ13": 2373,
      "Ġchildren": 2374,
      "Ġ'{": 2375,
      "ĠSieve": 2376,
      "ctions": 2377,
      "velop": 2378,
      "ĠEra": 2379,
      "Title": 2380,
      "Ġframe": 2381,
      "Ġstore": 2382,
      "tosthenes": 2383,
      "ĠEratosthenes": 2384,
      "matrix": 2385,
      "Ġcompeti": 2386,
      "Ġdynamic": 2387,
